app/controllers/expenses_controller.rb

  def create
    @expense = @group.expenses.build(expense_params)

    if @expense.save
      redirect_to([@expense.group, @expense], notice: 'Expense was successfully created.')
---
INSERT INTO "expenses" ("group_id", "name", "amount", "author_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["group_id", 1], ["name", "adcs"], ["amount", 5.2], ["author_id", 1], ["created_at", "2023-10-18 11:55:17.418173"], ["updated_at", "2023-10-18 11:55:17.418173"]]
SELECT "groups".* FROM "groups" WHERE "groups"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def set_group
    @group = Group.find(params[:group_id])
---
SELECT "groups".* FROM "groups" WHERE "groups"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def set_expense
    @expense = @group.expenses.find(params[:id])
---
SELECT "expenses".* FROM "expenses" WHERE "expenses"."group_id" = $1 AND "expenses"."id" = $2 LIMIT $3  [["group_id", 1], ["id", 1], ["LIMIT", 1]]