app/controllers/groups_controller.rb

  def index
    @groups = @user.groups
---
SELECT "groups".* FROM "groups" WHERE "groups"."user_id" = $1  [["user_id", 1]]

  def create
    @group = @user.groups.build(group_params)

    if @group.save
---
INSERT INTO "groups" ("name", "image_data", "user_id", "created_at", "updated_at", "icon") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"

  def update
    if @group.update(group_params)
---
UPDATE "groups" SET "image_data" = $1, "updated_at" = $2 WHERE "groups"."id" = $3

  def set_group
    @group = @user.groups.find(params[:id])
---
SELECT "groups".* FROM "groups" WHERE "groups"."user_id" = $1 AND "groups"."id" = $2 LIMIT $3  [["user_id", 1], ["id", 1], ["LIMIT", 1]]