app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("first_name", "last_name", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["first_name", "test"], ["last_name", "test"], ["created_at", "2023-10-16 09:11:24.350566"], ["updated_at", "2023-10-16 09:11:24.350566"]]