app/models/expense.rb

  def update_totals_on_increment
    author.increment!(:total, amount)
    group.increment!(:total, amount)
---
UPDATE "groups" SET "total" = COALESCE("total", 0) + $1 WHERE "groups"."id" = $2  [["total", 4535.0], ["id", 1]]