app/views/expenses/_form.html.erb

<%= form_with(model: [@expense.group, @expense]) do |f| %>
---
SELECT "groups".* FROM "groups" WHERE "groups"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]