app/views/expenses/index.html.erb

SELECT "groups".* FROM "groups" WHERE "groups"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    <td><%= expense.author %></td>
    <td><%= link_to 'Show', [expense.group, expense] %></td>