app/views/expenses/show.html.erb


<%= link_to 'Edit', edit_group_expense_path(@expense.group, @expense) %> |
---
SELECT "groups".* FROM "groups" WHERE "groups"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]